bench/custom/logs/rfuse/ramdisk/all/rfuse_write_ramdisk_none.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=161079: Thu May 30 05:25:51 2024
  write: IOPS=1263k, BW=4934MiB/s (5174MB/s)(32.0GiB/6641msec); 0 zone resets
    slat (usec): min=6, max=4672, avg=21.49, stdev= 5.79
    clat (nsec): min=329, max=1083.6k, avg=624.53, stdev=521.00
     lat (usec): min=6, max=4677, avg=22.11, stdev= 5.90
    clat percentiles (nsec):
     |  1.00th=[  350],  5.00th=[  362], 10.00th=[  374], 20.00th=[  434],
     | 30.00th=[  548], 40.00th=[  588], 50.00th=[  620], 60.00th=[  644],
     | 70.00th=[  668], 80.00th=[  716], 90.00th=[  820], 95.00th=[  948],
     | 99.00th=[ 1432], 99.50th=[ 1736], 99.90th=[ 2704], 99.95th=[ 3472],
     | 99.99th=[10048]
   bw (  MiB/s): min= 4322, max= 6242, per=100.00%, avg=5112.33, stdev=15.68, samples=399
   iops        : min=1106474, max=1598034, avg=1308755.26, stdev=4014.71, samples=399
  lat (nsec)   : 500=26.02%, 750=58.55%, 1000=11.46%
  lat (usec)   : 2=3.68%, 4=0.25%, 10=0.03%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=5, max=250, avg=12.73, stdev= 3.33
    sync percentiles (nsec):
     |  1.00th=[ 6624],  5.00th=[ 8256], 10.00th=[ 9024], 20.00th=[10176],
     | 30.00th=[11328], 40.00th=[12096], 50.00th=[12736], 60.00th=[13248],
     | 70.00th=[13888], 80.00th=[14656], 90.00th=[15808], 95.00th=[17024],
     | 99.00th=[21376], 99.50th=[25216], 99.90th=[41728], 99.95th=[46848],
     | 99.99th=[79360]
  cpu          : usr=5.59%, sys=36.06%, ctx=9455446, majf=0, minf=773
  IO depths    : 1=112.5%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,1048544 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4934MiB/s (5174MB/s), 4934MiB/s-4934MiB/s (5174MB/s-5174MB/s), io=32.0GiB (34.4GB), run=6641-6641msec